/*

Зробити:

- GameManager який передає всі дані на завантаженні до інших менеджерів і тд

- рука:
    містить в собі набір з карт
    максимум в руці: 11 карт
    виконує дві функції: приймає карту, викладає карти на стіл

- керування:
    дві функції: взяти карту, пас

- противник:
    ходить після гравця
    добирає карти, до певного порогу (15-20), можливо зробити якийсь алгоритм

В процесі:

+ колода карт SO:
    по 4 штуки на кожну карту
    карти: 2, 3, 4, 5, 6, 7, 8, 9, 3х10, 11/1 всього: 48 карт
+ карти SO:
    містить значення, одне або декілька
    містить два спрайти: передня та задня частина карти
+ карта клас:
    містить дані карти
    містить спрайт щоб буде показувати передню або задню частину карти
    може повертати дані про значення карти
    може бути відкрита або закрита
    може бути переназначена

Зроблено:

*/
